<?php
function debug($arr) {
    echo '<pre>' . print_r($arr, true) . '</pre>';
}

$arrayName = [
	"понедельник" => [
            "1" => "математика",
            "2" => "русский яз",
            "3" => "литература",
            "4" => "физкультура",
            "5" => "английский/немецкий",
            "6" => "музыка"
        ],
    "вторник" => [
            "1" => "математика",
            "2" => "русский яз",
            "3" => "литература",
            "4" => "биология",
            "5" => "технология",
            "6" => "технология",
            "7" => "в/д моделирование"
        ]
    ];
    debug($arrayName);
?>
