<?php
namespace vendor\core\base;

class Model {

    

	public $pattern = 'Цели изучения курса информатики. Информация вокруг нас. Компьютер – универсальная машина для работы с информацией. Техника безопасности и организация рабочего места;Введение, §1, §2(3);07.сен;1
Ввод информации в память компьютера. Клавиатура. Практическая работа №1 «Вспоминаем клавиатуру»;§3;14.сен;2
Управление компьютером. Практическая работа №2 «Вспоминаем приёмы управления компьютером»;§4;21.сен;3
Хранение информации. Практическая работа №3 «Создаём и сохраняем файлы»;§5,6;28.сен;4
Передача информации. Электронная почта. Практическая работа №4 «Работаем с электронной почтой»;§6 (1);05.окт;5
В мире кодов. Способы кодирования информации;§7,8 (1);12.окт;6
Основные объекты текстового документа. Ввод текста. Практическая работа №5 «Вводим текст»;§9 (3, 4);09.окт;7
Редактирование текста. Практическая работа №6 «Редактируем текст» Форматирование текста. Практическая работа №8 «Форматируем текст»;§9 (5);26.окт;8
Представление информации в форме таблиц. Структура таблицы. Практическая работа №9 «Создаём простые таблицы» (задания 1 и 2);§9 (1);09.ноя;9
Компьютерная графика. Графический редактор Paint Практическая работа №11 «Изучаем инструменты графического редактора»;§11 (1);16.ноя;10
Списки – способ упорядочивания информации. Практическая работа №14 «Создаём списки»;§12 (2);23.ноя;11
Поиск информации. Практическая работа №15 «Ищем информацию в сети Интернет»;§12 (3);30.ноя;12
Кодирование как изменение формы представления информации. Преобразование информации по заданным правилам. Практическая работа №16«Выполняем вычисления с помощью программы Калькулятор»;§12 (4);07.дек;13
Создание движущихся изображений. Практическая работа №17 «Создаём анимацию» (задание 1);§12 (8);14.дек;14
Создание анимации по собственному замыслу. Практическая работа №17 «Создаём анимацию» (задание 2);§12 (8);21.дек;15
Выполнение итогового мини-проекта. Практическая работа №18 «Создаем слайд-шоу»;;28.дек;16';	
    
}